{
T: [
	{
		name: 01 Baca dulu dong :)
		steps: [
			{
				text: Tutorial ini ditujukan untuk pengguna NotTiled baru.
				trigger: start
			}
			{
				text: "Jika Anda adalah pengguna lama, mohon untuk [Reload sampel] terlebih dahulu, karena kalau tidak, kemungkinan tutorialnya error."
				trigger: next
			}
			{
				text: "Caranya, buka  Menu> Links> Reload Sampel."
				trigger: next
			}
			{
				text: Terima kasih.
				trigger: next
			}
			{
				text: ""
				trigger: end
			}
		]
	}
	{
		name: 02 Membuat file & menambahkan tilesets
		steps: [
			{
				text: "Selamat Datang di NotTiled, aku akan menjadi panduan Anda. Sekarang, buka menu di sudut kiri bawah."
				trigger: start
			}
			{
				text: ""
				trigger: lockUI
			}
			{
				text: Klik pada New Berkas
				trigger: menu
			}
			{
				text: "Seperti yang Anda lihat, Anda dapat mengatur cukup banyak hal di sini."
				trigger: new
			}
			{
				text: "Atas satu nama file, pastikan untuk mengakhiri file Anda dengan .tmx"
				trigger: next
			}
			{
				text: "Kemudian, Anda dapat memilih folder di mana Anda ingin menyimpan file"
				trigger: next
			}
			{
				text: "Setelah itu, lebar genteng dan tinggi. Mereka adalah dimensi ubin Anda di peta. Mari kita gunakan 16x16."
				trigger: next
			}
			{
				text: 16
				trigger: settilesize
			}
			{
				text: Peta lebar dan tinggi adalah jumlah total genteng pada setiap sumbu. Kami akan menggunakan 30x30.
				trigger: next
			}
			{
				text: 30
				trigger: setmapsize
			}
			{
				text: "Sisanya adalah untuk pengguna tingkat lanjut, abaikan saja untuk saat ini."
				trigger: next
			}
			{
				text: "Oke, klik [OK]"
				trigger: next
			}
			{
				text: "Untuk membuat file kosong, klik [Create file kosong]"
				trigger: usetemplate
			}
			{
				text: Bagus! sekarang Anda dapat melihat peta kosong. Mari menempatkan tileset a.
				trigger: newmap
			}
			{
				text: Sebuah tileset hanyalah sebuah kata mewah untuk koleksi gambar dalam satu file.
				trigger: next
			}
			{
				text: Klik pemilih ubin di bagian tengah bawah.
				trigger: next
			}
			{
				text: "Klik [add tileset baru]"
				trigger: tilepick
			}
			{
				text: "Mari kita gunakan empat-musim-tileset.png. Jika Anda tidak dapat menemukannya, itu harus di / NotTiled / Contoh / folder."
				trigger: addtileset
			}
			{
				text: Cukup klik ok ...
				trigger: import
			}
			{
				text: "Bagus, sekarang klik pada ubin yang ingin Anda gunakan."
				trigger: tilesetadded
			}
			{
				text: Klik pada peta.
				trigger: tilepickclick
			}
			{
				text: Fantastis! mari kita coba satu lagi!
				trigger: tileclick
			}
			{
				text: Memilih mana yang Anda suka.
				trigger: tilepick
			}
			{
				text: Meletakkannya di peta ...
				trigger: tilepickclick
			}
			{
				text: "benar sangat mudah? NotTiled memiliki fitur autosave, tetapi Anda juga dapat menyimpan secara manual. Klik pada cepat tombol save."
				trigger: tileclick
			}
			{
				text: "Dilakukan dengan baik, Anda punya dasar. Sampai jumpa di tutorial lain."
				trigger: quicksave
			}
			{
				text: ""
				trigger: end
			}
		]
	}
	{
		name: 03 Pemetaan Dasar Rusted Warfare
		steps: [
			{
				text: "Selamat Datang di dasar pemetaan RW tutorial. Mari kita langsung ke dalam tindakan, akan kita? membuka menu."
				trigger: start
			}
			{
				text: ""
				trigger: lockUI
			}
			{
				text: klik pada file baru
				trigger: menu
			}
			{
				text: "Berkarat Warfare menggunakan 20x20 genteng. Jadi, pastikan lebar ubin dan tinggi ubin keduanya 20. Kami akan mengatur lebar peta dan tinggi dengan 50 dan 50. Setelah selesai, klik tombol [OK]"
				trigger: new
			}
			{
				text: 20
				trigger: settilesize
			}
			{
				text: "Pilih [Rusted Warfare Tutorial] dan tekan OK."
				trigger: usetemplate
			}
			{
				text: Sudah selesai dilakukan dengan baik! klik Apply.
				trigger: usetemplateok
			}
			{
				text: Baik!! pekerjaan yang baik sejauh ini!
				trigger: applytemplate
			}
			{
				text: "Berkarat peta Warfare sangat sederhana. Ini terdiri dari 3 lapisan. Tanah, Produk, dan Unit."
				trigger: next
			}
			{
				text: "Tanah adalah tempat Anda meletakkan lanskap, medan pertempuran, atau apa pun yang Anda menyebutnya."
				trigger: next
			}
			{
				text: Lapisan item adalah tempat Anda meletakkan kolam sumber daya antara lain.
				trigger: next
			}
			{
				text: "Unit lapisan untuk unit (duh), menempatkan pusat Command atau unit sini."
				trigger: next
			}
			{
				text: "Meletakkan hal-hal yang salah di tempat yang salah akan membuat peta Anda tidak dapat dimainkan, ingat itu."
				trigger: next
			}
			{
				text: "Sekarang, klik pada tombol seleksi layer di sudut kanan bawah."
				trigger: next
			}
			{
				text: "Lihat ikon mata? untuk saat ini, mari kita hide eveything kecuali lapisan tanah. Setelah selesai, klik pada lapisan tanah."
				trigger: layerpick
			}
			{
				text: "Oke, saya akan memberikan bimbingan. ikuti gambar."
				trigger: layerselected
			}
			{
				text: NotTiled/sample/template/Rusted Warfare Tutorial/export1.png
				trigger: changebg
			}
			{
				text: "Untuk melakukannya, Anda akan perlu memilih ubin. Klik tombol pemilihan ubin di bagian tengah bawah."
				trigger: next
			}
			{
				text: "sekarang, beralih ke [Batu Lava - Ridge] Tileset dengan menekan >> ikon dua kali. Setelah itu, klik pada ubin batu (kiri bawah satu)"
				trigger: tilepick
			}
			{
				text: "sekarang hanya mengikuti panduan ini, silakan menarik sebagai identik sebagai mungkin."
				trigger: tilepickclick
			}
			{
				text: "Untuk mempermudah, tekan dan tahan untuk membuat persegi panjang. Ketika Anda selesai, klik pada tombol Redo."
				trigger: next
			}
			{
				text: ""
				trigger: unlockUI
			}
			{
				text: "Oke, peta kita terlihat jelek, kan? Tidak masalah. Kami akan memperbaikinya. Aku akan memperpanjang panduan. Cukup ikuti itu. Tekan mengulang lagi ketika Anda selesai."
				trigger: redo
			}
			{
				text: NotTiled/sample/template/Rusted Warfare Tutorial/export2.png
				trigger: changebg
			}
			{
				text: "Well done, sekarang mari kita menghubungkan mereka semua. Ikuti panduan baru. Tekan mengulang lagi ketika Anda selesai."
				trigger: redo
			}
			{
				text: NotTiled/sample/template/Rusted Warfare Tutorial/export3.png
				trigger: changebg
			}
			{
				text: "Dilakukan dengan baik, sekarang mengisi sisanya dengan lava. Pilih lava Anda terlebih dahulu."
				trigger: redo
			}
			{
				text: Ini adalah salah satu di tengah.
				trigger: tilepick
			}
			{
				text: Sekarang klik pada alat mengisi.
				trigger: tilepickclick
			}
			{
				text: "Dilakukan dengan baik, mengisinya pada peta. Klik redo ketika selesai."
				trigger: tool3
			}
			{
				text: "Fantastis! kita selesai dengan lapisan tanah, sekarang mari kita kembali seleksi layer (kanan bawah) untuk."
				trigger: redo
			}
			{
				text: "Silakan menyembunyikan lapisan tanah, dan menunjukkan Barang lapisan (sehingga Anda bisa melihat panduan baru). Setelah selesai, klik layer Item."
				trigger: layerpick
			}
			{
				text: Oke mengikuti panduan baru.
				trigger: layerselected
			}
			{
				text: NotTiled/sample/template/Rusted Warfare Tutorial/export5.png
				trigger: changebg
			}
			{
				text: "Beralih ke [misc] tileset, dan tekan dan tahan kiri atas bagian dari kolam sumber daya untuk mengaktifkan modus cap, dan kemudian tarik untuk membuat pilihan 3x3"
				trigger: tilepick
			}
			{
				text: "Baik dilakukan. mengikuti gambar, dan tombol hit redo untuk melanjutkan."
				trigger: stamp
			}
			{
				text: "Dilakukan dengan baik, sekarang mari kita lanjutkan dengan lapisan akhir. Unit lapisan. mari kita kembali seleksi layer ke"
				trigger: redo
			}
			{
				text: "Silakan menyembunyikan item lapisan, dan menunjukkan Unit lapisan (untuk bimbingan). Setelah selesai, klik layer Unit."
				trigger: layerpick
			}
			{
				text: "Oke, Anda tahu apa yang harus dilakukan. Ikuti panduan."
				trigger: layerselected
			}
			{
				text: NotTiled/sample/template/Rusted Warfare Tutorial/export6.png
				trigger: changebg
			}
			{
				text: "Beralih ke [unit] tileset, dan menemukan unit yang benar."
				trigger: tilepick
			}
			{
				text: "Itu dia. mengikuti gambar, dan seperti biasa, tombol Redo memukul untuk melanjutkan."
				trigger: tileclick
			}
			{
				text: Super! sekarang Anda dapat kembali ke pemilihan lapisan dan menunjukkan semua lapisan untuk melihat karya Anda. Klik Redo ketika Anda selesai.
				trigger: redo
			}
			{
				text: "Oke, mari kita mengambil screenshot sehingga Anda memetakan akan memiliki thumbnail pada Rusted Warfare. Hanya zoom out sampai Anda melihat tombol."
				trigger: redo
			}
			{
				text: "Bagus! Hanya satu langkah lagi! Menyalin file ke folder Rusted Warfare. Anda dapat melakukannya secara manual, tapi lebih mudah hanya untuk mengirimkannya dari NotTiled. Tampilannya kembali untuk menampilkan kontrol dan Klik menu."
				trigger: screenshot
			}
			{
				text: klik pada Link
				trigger: menu
			}
			{
				text: klik Salin ke Rusted Warfare
				trigger: links
			}
			{
				text: Baik dilakukan! sekarang pergi ke Rusted Warfare dan menikmati peta baru Anda! Saya harap tutorial ini membantu Anda untuk memahami dasar RW mappping. Terima kasih dan melihat Anda di tutorial lain.
				trigger: copytorw
			}
			{
				text: ""
				trigger: end
			}
		]
	}
	{
		name: 04 Pemetaan menggunakan Autotiles
		steps: [
			{
				text: "Selamat datang kembali! Pastikan Anda telah mengambil pemetaan RW tutorial dasar pertama, jika tidak hanya membatalkan tutorial ini. Oke, sekarang, buka menu."
				trigger: start
			}
			{
				text: ""
				trigger: lockUI
			}
			{
				text: klik pada file baru
				trigger: menu
			}
			{
				text: "Mari kita menggunakan ukuran yang sama ubin (20x20) dan ukuran peta dari sebelumnya (50x50). Setelah selesai, klik tombol [OK]"
				trigger: new
			}
			{
				text: "Sekarang pilih [Rusted Warfare] dan tekan OK."
				trigger: usetemplate
			}
			{
				text: "Dilakukan dengan baik, Anda dapat melihat bahwa ada cukup banyak tilesets. Biarkan tetap seperti itu, gulir ke bawah dan klik Apply."
				trigger: usetemplateok
			}
			{
				text: Baik!! Peta kosong lain :)
				trigger: applytemplate
			}
			{
				text: ""
				trigger: unlockUI
			}
			{
				text: Anda mungkin memperhatikan bahwa ada 2 tombol tambahan di bagian bawah
				trigger: next
			}
			{
				text: "Yang benar adalah tombol pemilihan Autotile, itu adalah seperti pemilihan genteng, tapi untuk autotiles."
				trigger: next
			}
			{
				text: "Yang kiri adalah tombol Refresh, untuk menerapkan autotiles ke peta."
				trigger: next
			}
			{
				text: teori cukup! mari kita mulai dengan klik pada tombol pemilihan lapisan kami (pojok kanan bawah).
				trigger: next
			}
			{
				text: "Ada lebih lapisan yang tepat? Set lapisan adalah tempat kita menaruh autotiles kami, sedangkan lapisan memicu ... abaikan saja untuk saat ini :)"
				trigger: layerpick
			}
			{
				text: "Seperti biasa, saya ingin Anda untuk menyembunyikan semua lapisan (bimbingan), kecuali [Set] lapisan. Kami akan menggunakan itu. Ketika Anda selesai, pilih Set lapisan."
				trigger: next
			}
			{
				text: "Oke, di sini datang bimbingan. Ikuti itu. Pastikan Anda berada di [Set] lapisan."
				trigger: layerselected
			}
			{
				text: NotTiled/sample/template/Rusted Warfare/export1a.png
				trigger: changebg
			}
			{
				text: "Tapi pertama, Anda akan perlu untuk memilih sebuah autotile. Klik tombol pemilihan autotile di bagian bawah."
				trigger: next
			}
			{
				text: "Mari kita gunakan [Grass] autotile. Klik di atasnya, dan ikuti panduan. Tekan mengulang ketika Anda selesai."
				trigger: autopick
			}
			{
				text: "Oke, sekarang mengisi sisanya dengan [air dangkal]. Pastikan untuk menggunakan [Shallow Water], bukan [air] (mereka tidak campuran)."
				trigger: redo
			}
			{
				text: "Sekarang, longpress (tekan dan tahan) tombol refresh."
				trigger: redo
			}
			{
				text: "Tidak ada yang terjadi? nggak. Tampilkan lapisan tanah Anda (dan menyembunyikan lapisan Set, duh) dan Anda akan melihat hasilnya."
				trigger: refresh
			}
			{
				text: Keren bukan? Jauh lebih mudah daripada sebelumnya! Kekuatan autotiles! : P
				trigger: redo
			}
			{
				text: "Langkah berikutnya adalah sama (Produk lapisan & Units), jadi saya tidak akan mengulanginya lagi."
				trigger: next
			}
			{
				text: Perhatikan bahwa autotiles tidak sempurna. Ini tidak bisa melakukan apa-apa tentang ubin yang tidak memiliki ubin berdekatan.
				trigger: next
			}
			{
				text: "dan tidak setiap autotiles dapat bercampur dengan autotiles lainnya. Sebagai contoh, air hanya dapat mencampur dengan Shallow Water dan Deep Water."
				trigger: next
			}
			{
				text: "Itu saja, Anda dapat menyelesaikan peta jika Anda ingin :) Sampai jumpa di tutorial berikutnya!"
				trigger: next
			}
			{
				text: ""
				trigger: end
			}
		]
	}
	{
		name: 05 Pixel Editor
		steps: [
			{
				text: "Selamat datang kembali! Tutorial ini adalah berbeda sedikit, kita akan menggunakan NotTiled sebagai Pixel Editor."
				trigger: start
			}
			{
				text: ""
				trigger: lockUI
			}
			{
				text: Klik pada file baru
				trigger: menu
			}
			{
				text: "Pixel editor menggunakan 1x1 genteng, saya akan mengaturnya untuk Anda. Saya sarankan peta ukuran 16x16 untuk tutorial ini. Setelah selesai, klik tombol [OK]"
				trigger: new
			}
			{
				text: 1
				trigger: settilesize
			}
			{
				text: "Sekarang pilih [Pixel Editor] dan tekan OK."
				trigger: usetemplate
			}
			{
				text: Klik Apply.
				trigger: usetemplateok
			}
			{
				text: Baik!! sangat mudah.
				trigger: applytemplate
			}
			{
				text: ""
				trigger: unlockUI
			}
			{
				text: "Untuk menggambar sesuatu, memilih warna dari pemilih (tengah bawah)."
				trigger: next
			}
			{
				text: Pilih warna yang Anda suka.
				trigger: tilepick
			}
			{
				text: Meletakkannya pada peta.
				trigger: tilepickclick
			}
			{
				text: "Fantastis! untuk membuat PNG Anda, menu goto."
				trigger: tileclick
			}
			{
				text: klik Ekspor
				trigger: menu
			}
			{
				text: "Masukan nama file (tanpa ekstensi), dan klik Ekspor ke PNG"
				trigger: export
			}
			{
				text: Sudah selesai dilakukan dengan baik.
				trigger: exporttopng
			}
			{
				text: "Anda juga dapat membuat lembar animasi dengan menggambar pada beberapa Layers, dan Ekspor sebagai Tileset."
				trigger: next
			}
			{
				text: Anda dapat membuat lapisan bernyawa oleh longpressing tombol Redo
				trigger: next
			}
			{
				text: "Oh, dan untuk mengedit PNG yang ada, hanya impor sebagai tileset, dan kemudian cap itu pada layer Anda."
				trigger: next
			}
			{
				text: "Terima kasih, melihat Anda di tutorial lain."
				trigger: next
			}
			{
				text: ""
				trigger: end
			}
		]
	}
	{
		name: 06 Platformer 2D
		steps: [
			{
				text: "Selamat datang kembali! Saya membuat platformer NotTiled ini sehingga kita bisa membuat game di NotTiled. Ini masih baru, sehingga tidak baik ... Namun demikian, hanya mencobanya. Buka menu"
				trigger: start
			}
			{
				text: ""
				trigger: lockUI
			}
			{
				text: Klik pada file baru
				trigger: menu
			}
			{
				text: Pastikan untuk menempatkan file Anda dalam NotTiled / sampel / folder
				trigger: new
			}
			{
				text: 16
				trigger: settilesize
			}
			{
				text: "Sekarang pilih [NotTiled platformer] dan tekan OK."
				trigger: usetemplate
			}
			{
				text: Klik Apply.
				trigger: usetemplateok
			}
			{
				text: Baik!! sangat mudah.
				trigger: applytemplate
			}
			{
				text: ""
				trigger: unlockUI
			}
			{
				text: "Untuk menggambar sesuatu, memilih item dari pemilih (tengah bawah)."
				trigger: next
			}
			{
				text: Memilih item apapun yang Anda suka.
				trigger: tilepick
			}
			{
				text: "Minimal, Anda akan memerlukan manusia sebagai pemain, dan gadis sebagai garis finish. (Klise, saya tahu. Anda dapat mengubahnya pula)"
				trigger: next
			}
			{
				text: "Untuk hal-hal lain, coba saja sendiri, oke? :)"
				trigger: next
			}
			{
				text: Meletakkannya pada peta.
				trigger: tilepickclick
			}
			{
				text: "Fantastico! untuk bermain game, klik tombol Play di sebelah kiri."
				trigger: tileclick
			}
			{
				text: ""
				trigger: end
			}
		]
	}
]
}